
# tap repositories and their packages

tap 'homebrew/core'
tap 'homebrew/cask'
cask 'android-platform-tools'
cask 'betterdisplay'
cask 'brave-browser'
cask 'claude'
cask 'deskpad'
cask 'ghostty'
cask 'google-cloud-sdk'
cask 'kap'
cask 'notion'
cask 'openvpn-connect'
cask 'raycast'
cask 'stats'
cask 'tailscale'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'GarageBand (10.4.12)', id: 682658836
mas 'iMovie (10.4.3)', id: 408981434
mas 'Keynote (14.4)', id: 409183694
mas 'Numbers (14.4)', id: 409203825
mas 'Pages (14.4)', id: 409201541
mas 'WhatsApp (25.17.82)', id: 310633997
mas 'Perplexity (2.250710.0)', id: 6714467650
