
# tap repositories and their packages

tap 'homebrew/core'
brew 'act'
brew 'aom'
brew 'aria2'
brew 'aribb24'
brew 'assh'
brew 'atuin'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'azure-cli'
brew 'bat'
brew 'bat-extras'
brew 'bpytop'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'certifi'
brew 'cffi'
brew 'cjson'
brew 'cryptography'
brew 'dav1d'
brew 'diff-so-fancy'
brew 'duf'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'fpp'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gcc'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'git'
brew 'git-extras'
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'graphite2'
brew 'harfbuzz'
brew 'helm'
brew 'highway'
brew 'httpie'
brew 'icu4c@77'
brew 'imath'
brew 'isl'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'k9s'
brew 'kubernetes-cli'
brew 'lame'
brew 'lazydocker'
brew 'lazygit'
brew 'lego'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libb2'
brew 'libbluray'
brew 'libdeflate'
brew 'libevent'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'liblinear'
brew 'libmicrohttpd'
brew 'libmpc'
brew 'libnghttp2'
brew 'libogg'
brew 'libpng'
brew 'librist'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'lpeg'
brew 'lua'
brew 'luajit'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'mas'
brew 'mbedtls'
brew 'minikube'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'msgpack'
brew 'ncurses'
brew 'neovim'
brew 'nettle'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'nvm'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjpeg'
brew 'openssl@3'
brew 'opus'
brew 'osx-cpu-temp'
brew 'p11-kit'
brew 'pango'
brew 'pcre2'
brew 'pinentry'
brew 'pixman'
brew 'pv'
brew 'pycparser'
brew 'python@3.12'
brew 'python@3.13'
brew 'ranger'
brew 'rav1e'
brew 'rclone'
brew 'readline'
brew 'ripgrep'
brew 'rubberband'
brew 'sd'
brew 'sdl2'
brew 'sleepwatcher'
brew 'snappy'
brew 'speedtest-cli'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'svt-av1'
brew 'tenv'
brew 'terraform-docs'
brew 'tesseract'
brew 'theora'
brew 'tig'
brew 'tmate'
brew 'tmux'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'uv'
brew 'webp'
brew 'x264'
brew 'x265'
brew 'xh'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'yadm'
brew 'yt-dlp'
brew 'zeromq'
brew 'zimg'
brew 'zoxide'
brew 'zstd'

tap 'homebrew/cask'
cask 'betterdisplay'
cask 'brave-browser'
cask 'claude'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'ghostty'
cask 'google-cloud-sdk'
cask 'kap'
cask 'notion'
cask 'openvpn-connect'
cask 'raycast'
cask 'tailscale'
cask 'visual-studio-code'
cask 'warp'
cask 'zed'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'GarageBand (10.4.12)', id: 682658836
mas 'iMovie (10.4.3)', id: 408981434
mas 'Keynote (14.4)', id: 409183694
mas 'Numbers (14.4)', id: 409203825
mas 'Pages (14.4)', id: 409201541
mas 'WhatsApp (25.16.81)', id: 310633997
